Revit 2027 API
TableSectionData.GetCellCategoryId(Int32) Method
 Returns a column's ParamId Associated with the paramId to find the correct element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetCellCategoryId(
	int nCol
)
Public Function GetCellCategoryId (
	nCol As Integer
) As ElementId
public:
ElementId^ GetCellCategoryId(
	int nCol
)
member GetCellCategoryId :
        nCol : int -> ElementId
Parameters
nCol Int32
Return Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
GetCellCategoryId Overload
Autodesk.Revit.DB Namespace